/* GENERATED by `cargo xtask dump-abi`. Do not edit by hand. */
/* Kandelo-owned wasm32 OSS source ABI; independent of the host UAPI. */
#ifndef KANDELO_SYS_SOUNDCARD_H
#define KANDELO_SYS_SOUNDCARD_H

#include <stddef.h>
#include <stdint.h>

#define AFMT_QUERY 0x00000000u
#define AFMT_MU_LAW 0x00000001u
#define AFMT_A_LAW 0x00000002u
#define AFMT_IMA_ADPCM 0x00000004u
#define AFMT_U8 0x00000008u
#define AFMT_S16_LE 0x00000010u
#define AFMT_S16_BE 0x00000020u
#define AFMT_S8 0x00000040u
#define AFMT_U16_LE 0x00000080u
#define AFMT_U16_BE 0x00000100u
#define AFMT_MPEG 0x00000200u
#define AFMT_AC3 0x00000400u
#define AFMT_S32_LE 0x00001000u
#define AFMT_S32_BE 0x00002000u
#define AFMT_U32_LE 0x00004000u
#define AFMT_U32_BE 0x00008000u
#define AFMT_S24_LE 0x00010000u
#define AFMT_S24_BE 0x00020000u
#define AFMT_U24_LE 0x00040000u
#define AFMT_U24_BE 0x00080000u
#define AFMT_F32_LE 0x10000000u
#define AFMT_F32_BE 0x20000000u
#define AFMT_S16_NE AFMT_S16_LE
#define AFMT_S16_OE AFMT_S16_BE
#define AFMT_S24_NE AFMT_S24_LE
#define AFMT_S24_OE AFMT_S24_BE
#define AFMT_S32_NE AFMT_S32_LE
#define AFMT_S32_OE AFMT_S32_BE
#define AFMT_U16_NE AFMT_U16_LE
#define AFMT_U16_OE AFMT_U16_BE
#define AFMT_U24_NE AFMT_U24_LE
#define AFMT_U24_OE AFMT_U24_BE
#define AFMT_U32_NE AFMT_U32_LE
#define AFMT_U32_OE AFMT_U32_BE
#define AFMT_F32_NE AFMT_F32_LE
#define AFMT_F32_OE AFMT_F32_BE
#define AFMT_FLOAT AFMT_F32_NE

typedef struct audio_buf_info {
	int32_t fragments;
	int32_t fragstotal;
	int32_t fragsize;
	int32_t bytes;
} audio_buf_info;

typedef struct count_info {
	int32_t bytes;
	int32_t blocks;
	int32_t ptr;
} count_info;

/* Declared for source compatibility; Kandelo does not support DSP mmap. */
typedef struct buffmem_desc {
	void *buffer;
	int32_t size;
} buffmem_desc;

#define SNDCTL_DSP_RESET 0x00005000u
#define SNDCTL_DSP_SYNC 0x00005001u
#define SNDCTL_DSP_SPEED 0xc0045002u
#define SNDCTL_DSP_STEREO 0xc0045003u
#define SNDCTL_DSP_GETBLKSIZE 0xc0045004u
#define SNDCTL_DSP_SETBLKSIZE 0x40045004u
#define SNDCTL_DSP_SETFMT 0xc0045005u
#define SNDCTL_DSP_CHANNELS 0xc0045006u
#define SOUND_PCM_WRITE_FILTER 0xc0045007u
#define SNDCTL_DSP_POST 0x00005008u
#define SNDCTL_DSP_SUBDIVIDE 0xc0045009u
#define SNDCTL_DSP_SETFRAGMENT 0xc004500au
#define SNDCTL_DSP_GETFMTS 0x8004500bu
#define SNDCTL_DSP_GETOSPACE 0x8010500cu
#define SNDCTL_DSP_GETISPACE 0x8010500du
#define SNDCTL_DSP_NONBLOCK 0x0000500eu
#define SNDCTL_DSP_GETCAPS 0x8004500fu
#define SNDCTL_DSP_SETTRIGGER 0x40045010u
#define SNDCTL_DSP_GETTRIGGER 0x80045010u
#define SNDCTL_DSP_GETIPTR 0x800c5011u
#define SNDCTL_DSP_GETOPTR 0x800c5012u
#define SNDCTL_DSP_MAPINBUF 0x80085013u
#define SNDCTL_DSP_MAPOUTBUF 0x80085014u
#define SNDCTL_DSP_SETSYNCRO 0x00005015u
#define SNDCTL_DSP_SETDUPLEX 0x00005016u
#define SNDCTL_DSP_GETODELAY 0x80045017u
#define SOUND_PCM_READ_RATE 0x80045002u
#define SOUND_PCM_READ_BITS 0x80045005u
#define SOUND_PCM_READ_CHANNELS 0x80045006u
#define SOUND_PCM_READ_FILTER 0x80045007u
#define SNDCTL_DSP_HALT SNDCTL_DSP_RESET
#define SNDCTL_DSP_SAMPLESIZE SNDCTL_DSP_SETFMT
#define SOUND_PCM_WRITE_RATE SNDCTL_DSP_SPEED
#define SOUND_PCM_WRITE_CHANNELS SNDCTL_DSP_CHANNELS
#define SOUND_PCM_WRITE_BITS SNDCTL_DSP_SETFMT
#define SOUND_PCM_SETFMT SNDCTL_DSP_SETFMT
#define SOUND_PCM_POST SNDCTL_DSP_POST
#define SOUND_PCM_RESET SNDCTL_DSP_RESET
#define SOUND_PCM_SYNC SNDCTL_DSP_SYNC
#define SOUND_PCM_SUBDIVIDE SNDCTL_DSP_SUBDIVIDE
#define SOUND_PCM_SETFRAGMENT SNDCTL_DSP_SETFRAGMENT
#define SOUND_PCM_GETFMTS SNDCTL_DSP_GETFMTS
#define SOUND_PCM_GETOSPACE SNDCTL_DSP_GETOSPACE
#define SOUND_PCM_GETISPACE SNDCTL_DSP_GETISPACE
#define SOUND_PCM_NONBLOCK SNDCTL_DSP_NONBLOCK
#define SOUND_PCM_GETCAPS SNDCTL_DSP_GETCAPS
#define SOUND_PCM_GETTRIGGER SNDCTL_DSP_GETTRIGGER
#define SOUND_PCM_SETTRIGGER SNDCTL_DSP_SETTRIGGER
#define SOUND_PCM_SETSYNCRO SNDCTL_DSP_SETSYNCRO
#define SOUND_PCM_GETIPTR SNDCTL_DSP_GETIPTR
#define SOUND_PCM_GETOPTR SNDCTL_DSP_GETOPTR
#define SOUND_PCM_MAPINBUF SNDCTL_DSP_MAPINBUF
#define SOUND_PCM_MAPOUTBUF SNDCTL_DSP_MAPOUTBUF

#define PCM_ENABLE_INPUT 0x00000001u
#define PCM_ENABLE_OUTPUT 0x00000002u

#define PCM_CAP_REVISION 0x000000ffu
#define PCM_CAP_DUPLEX 0x00000100u
#define PCM_CAP_REALTIME 0x00000200u
#define PCM_CAP_BATCH 0x00000400u
#define PCM_CAP_COPROC 0x00000800u
#define PCM_CAP_TRIGGER 0x00001000u
#define PCM_CAP_MMAP 0x00002000u
#define PCM_CAP_MULTI 0x00004000u
#define PCM_CAP_BIND 0x00008000u
#define PCM_CAP_INPUT 0x00010000u
#define PCM_CAP_OUTPUT 0x00020000u
#define PCM_CAP_VIRTUAL 0x00040000u
#define PCM_CAP_DEFAULT 0x40000000u
#define DSP_CAP_REVISION PCM_CAP_REVISION
#define DSP_CAP_DUPLEX PCM_CAP_DUPLEX
#define DSP_CAP_REALTIME PCM_CAP_REALTIME
#define DSP_CAP_BATCH PCM_CAP_BATCH
#define DSP_CAP_COPROC PCM_CAP_COPROC
#define DSP_CAP_TRIGGER PCM_CAP_TRIGGER
#define DSP_CAP_MMAP PCM_CAP_MMAP
#define DSP_CAP_MULTI PCM_CAP_MULTI
#define DSP_CAP_BIND PCM_CAP_BIND
#define DSP_CAP_INPUT PCM_CAP_INPUT
#define DSP_CAP_OUTPUT PCM_CAP_OUTPUT
#define DSP_CAP_VIRTUAL PCM_CAP_VIRTUAL
#define DSP_CAP_DEFAULT PCM_CAP_DEFAULT

#if defined(__STDC_VERSION__) && __STDC_VERSION__ >= 201112L
_Static_assert(AFMT_QUERY == 0x00000000u, "AFMT_QUERY ABI");
_Static_assert(AFMT_MU_LAW == 0x00000001u, "AFMT_MU_LAW ABI");
_Static_assert(AFMT_A_LAW == 0x00000002u, "AFMT_A_LAW ABI");
_Static_assert(AFMT_IMA_ADPCM == 0x00000004u, "AFMT_IMA_ADPCM ABI");
_Static_assert(AFMT_U8 == 0x00000008u, "AFMT_U8 ABI");
_Static_assert(AFMT_S16_LE == 0x00000010u, "AFMT_S16_LE ABI");
_Static_assert(AFMT_S16_BE == 0x00000020u, "AFMT_S16_BE ABI");
_Static_assert(AFMT_S8 == 0x00000040u, "AFMT_S8 ABI");
_Static_assert(AFMT_U16_LE == 0x00000080u, "AFMT_U16_LE ABI");
_Static_assert(AFMT_U16_BE == 0x00000100u, "AFMT_U16_BE ABI");
_Static_assert(AFMT_MPEG == 0x00000200u, "AFMT_MPEG ABI");
_Static_assert(AFMT_AC3 == 0x00000400u, "AFMT_AC3 ABI");
_Static_assert(AFMT_S32_LE == 0x00001000u, "AFMT_S32_LE ABI");
_Static_assert(AFMT_S32_BE == 0x00002000u, "AFMT_S32_BE ABI");
_Static_assert(AFMT_U32_LE == 0x00004000u, "AFMT_U32_LE ABI");
_Static_assert(AFMT_U32_BE == 0x00008000u, "AFMT_U32_BE ABI");
_Static_assert(AFMT_S24_LE == 0x00010000u, "AFMT_S24_LE ABI");
_Static_assert(AFMT_S24_BE == 0x00020000u, "AFMT_S24_BE ABI");
_Static_assert(AFMT_U24_LE == 0x00040000u, "AFMT_U24_LE ABI");
_Static_assert(AFMT_U24_BE == 0x00080000u, "AFMT_U24_BE ABI");
_Static_assert(AFMT_F32_LE == 0x10000000u, "AFMT_F32_LE ABI");
_Static_assert(AFMT_F32_BE == 0x20000000u, "AFMT_F32_BE ABI");
_Static_assert(SNDCTL_DSP_RESET == 0x00005000u, "SNDCTL_DSP_RESET ABI");
_Static_assert(SNDCTL_DSP_SYNC == 0x00005001u, "SNDCTL_DSP_SYNC ABI");
_Static_assert(SNDCTL_DSP_SPEED == 0xc0045002u, "SNDCTL_DSP_SPEED ABI");
_Static_assert(SNDCTL_DSP_STEREO == 0xc0045003u, "SNDCTL_DSP_STEREO ABI");
_Static_assert(SNDCTL_DSP_GETBLKSIZE == 0xc0045004u, "SNDCTL_DSP_GETBLKSIZE ABI");
_Static_assert(SNDCTL_DSP_SETBLKSIZE == 0x40045004u, "SNDCTL_DSP_SETBLKSIZE ABI");
_Static_assert(SNDCTL_DSP_SETFMT == 0xc0045005u, "SNDCTL_DSP_SETFMT ABI");
_Static_assert(SNDCTL_DSP_CHANNELS == 0xc0045006u, "SNDCTL_DSP_CHANNELS ABI");
_Static_assert(SOUND_PCM_WRITE_FILTER == 0xc0045007u, "SOUND_PCM_WRITE_FILTER ABI");
_Static_assert(SNDCTL_DSP_POST == 0x00005008u, "SNDCTL_DSP_POST ABI");
_Static_assert(SNDCTL_DSP_SUBDIVIDE == 0xc0045009u, "SNDCTL_DSP_SUBDIVIDE ABI");
_Static_assert(SNDCTL_DSP_SETFRAGMENT == 0xc004500au, "SNDCTL_DSP_SETFRAGMENT ABI");
_Static_assert(SNDCTL_DSP_GETFMTS == 0x8004500bu, "SNDCTL_DSP_GETFMTS ABI");
_Static_assert(SNDCTL_DSP_GETOSPACE == 0x8010500cu, "SNDCTL_DSP_GETOSPACE ABI");
_Static_assert(SNDCTL_DSP_GETISPACE == 0x8010500du, "SNDCTL_DSP_GETISPACE ABI");
_Static_assert(SNDCTL_DSP_NONBLOCK == 0x0000500eu, "SNDCTL_DSP_NONBLOCK ABI");
_Static_assert(SNDCTL_DSP_GETCAPS == 0x8004500fu, "SNDCTL_DSP_GETCAPS ABI");
_Static_assert(SNDCTL_DSP_SETTRIGGER == 0x40045010u, "SNDCTL_DSP_SETTRIGGER ABI");
_Static_assert(SNDCTL_DSP_GETTRIGGER == 0x80045010u, "SNDCTL_DSP_GETTRIGGER ABI");
_Static_assert(SNDCTL_DSP_GETIPTR == 0x800c5011u, "SNDCTL_DSP_GETIPTR ABI");
_Static_assert(SNDCTL_DSP_GETOPTR == 0x800c5012u, "SNDCTL_DSP_GETOPTR ABI");
_Static_assert(SNDCTL_DSP_MAPINBUF == 0x80085013u, "SNDCTL_DSP_MAPINBUF ABI");
_Static_assert(SNDCTL_DSP_MAPOUTBUF == 0x80085014u, "SNDCTL_DSP_MAPOUTBUF ABI");
_Static_assert(SNDCTL_DSP_SETSYNCRO == 0x00005015u, "SNDCTL_DSP_SETSYNCRO ABI");
_Static_assert(SNDCTL_DSP_SETDUPLEX == 0x00005016u, "SNDCTL_DSP_SETDUPLEX ABI");
_Static_assert(SNDCTL_DSP_GETODELAY == 0x80045017u, "SNDCTL_DSP_GETODELAY ABI");
_Static_assert(SOUND_PCM_READ_RATE == 0x80045002u, "SOUND_PCM_READ_RATE ABI");
_Static_assert(SOUND_PCM_READ_BITS == 0x80045005u, "SOUND_PCM_READ_BITS ABI");
_Static_assert(SOUND_PCM_READ_CHANNELS == 0x80045006u, "SOUND_PCM_READ_CHANNELS ABI");
_Static_assert(SOUND_PCM_READ_FILTER == 0x80045007u, "SOUND_PCM_READ_FILTER ABI");
_Static_assert(PCM_ENABLE_INPUT == 0x00000001u, "PCM_ENABLE_INPUT ABI");
_Static_assert(PCM_ENABLE_OUTPUT == 0x00000002u, "PCM_ENABLE_OUTPUT ABI");
_Static_assert(PCM_CAP_REVISION == 0x000000ffu, "PCM_CAP_REVISION ABI");
_Static_assert(PCM_CAP_DUPLEX == 0x00000100u, "PCM_CAP_DUPLEX ABI");
_Static_assert(PCM_CAP_REALTIME == 0x00000200u, "PCM_CAP_REALTIME ABI");
_Static_assert(PCM_CAP_BATCH == 0x00000400u, "PCM_CAP_BATCH ABI");
_Static_assert(PCM_CAP_COPROC == 0x00000800u, "PCM_CAP_COPROC ABI");
_Static_assert(PCM_CAP_TRIGGER == 0x00001000u, "PCM_CAP_TRIGGER ABI");
_Static_assert(PCM_CAP_MMAP == 0x00002000u, "PCM_CAP_MMAP ABI");
_Static_assert(PCM_CAP_MULTI == 0x00004000u, "PCM_CAP_MULTI ABI");
_Static_assert(PCM_CAP_BIND == 0x00008000u, "PCM_CAP_BIND ABI");
_Static_assert(PCM_CAP_INPUT == 0x00010000u, "PCM_CAP_INPUT ABI");
_Static_assert(PCM_CAP_OUTPUT == 0x00020000u, "PCM_CAP_OUTPUT ABI");
_Static_assert(PCM_CAP_VIRTUAL == 0x00040000u, "PCM_CAP_VIRTUAL ABI");
_Static_assert(PCM_CAP_DEFAULT == 0x40000000u, "PCM_CAP_DEFAULT ABI");
_Static_assert(SNDCTL_DSP_HALT == SNDCTL_DSP_RESET, "SNDCTL_DSP_HALT source alias");
_Static_assert(SNDCTL_DSP_SAMPLESIZE == SNDCTL_DSP_SETFMT, "SNDCTL_DSP_SAMPLESIZE source alias");
_Static_assert(SOUND_PCM_WRITE_RATE == SNDCTL_DSP_SPEED, "SOUND_PCM_WRITE_RATE source alias");
_Static_assert(SOUND_PCM_WRITE_CHANNELS == SNDCTL_DSP_CHANNELS, "SOUND_PCM_WRITE_CHANNELS source alias");
_Static_assert(SOUND_PCM_WRITE_BITS == SNDCTL_DSP_SETFMT, "SOUND_PCM_WRITE_BITS source alias");
_Static_assert(SOUND_PCM_SETFMT == SNDCTL_DSP_SETFMT, "SOUND_PCM_SETFMT source alias");
_Static_assert(SOUND_PCM_POST == SNDCTL_DSP_POST, "SOUND_PCM_POST source alias");
_Static_assert(SOUND_PCM_RESET == SNDCTL_DSP_RESET, "SOUND_PCM_RESET source alias");
_Static_assert(SOUND_PCM_SYNC == SNDCTL_DSP_SYNC, "SOUND_PCM_SYNC source alias");
_Static_assert(SOUND_PCM_SUBDIVIDE == SNDCTL_DSP_SUBDIVIDE, "SOUND_PCM_SUBDIVIDE source alias");
_Static_assert(SOUND_PCM_SETFRAGMENT == SNDCTL_DSP_SETFRAGMENT, "SOUND_PCM_SETFRAGMENT source alias");
_Static_assert(SOUND_PCM_GETFMTS == SNDCTL_DSP_GETFMTS, "SOUND_PCM_GETFMTS source alias");
_Static_assert(SOUND_PCM_GETOSPACE == SNDCTL_DSP_GETOSPACE, "SOUND_PCM_GETOSPACE source alias");
_Static_assert(SOUND_PCM_GETISPACE == SNDCTL_DSP_GETISPACE, "SOUND_PCM_GETISPACE source alias");
_Static_assert(SOUND_PCM_NONBLOCK == SNDCTL_DSP_NONBLOCK, "SOUND_PCM_NONBLOCK source alias");
_Static_assert(SOUND_PCM_GETCAPS == SNDCTL_DSP_GETCAPS, "SOUND_PCM_GETCAPS source alias");
_Static_assert(SOUND_PCM_GETTRIGGER == SNDCTL_DSP_GETTRIGGER, "SOUND_PCM_GETTRIGGER source alias");
_Static_assert(SOUND_PCM_SETTRIGGER == SNDCTL_DSP_SETTRIGGER, "SOUND_PCM_SETTRIGGER source alias");
_Static_assert(SOUND_PCM_SETSYNCRO == SNDCTL_DSP_SETSYNCRO, "SOUND_PCM_SETSYNCRO source alias");
_Static_assert(SOUND_PCM_GETIPTR == SNDCTL_DSP_GETIPTR, "SOUND_PCM_GETIPTR source alias");
_Static_assert(SOUND_PCM_GETOPTR == SNDCTL_DSP_GETOPTR, "SOUND_PCM_GETOPTR source alias");
_Static_assert(SOUND_PCM_MAPINBUF == SNDCTL_DSP_MAPINBUF, "SOUND_PCM_MAPINBUF source alias");
_Static_assert(SOUND_PCM_MAPOUTBUF == SNDCTL_DSP_MAPOUTBUF, "SOUND_PCM_MAPOUTBUF source alias");
_Static_assert(AFMT_S16_NE == AFMT_S16_LE, "AFMT_S16_NE source alias");
_Static_assert(AFMT_S16_OE == AFMT_S16_BE, "AFMT_S16_OE source alias");
_Static_assert(AFMT_S24_NE == AFMT_S24_LE, "AFMT_S24_NE source alias");
_Static_assert(AFMT_S24_OE == AFMT_S24_BE, "AFMT_S24_OE source alias");
_Static_assert(AFMT_S32_NE == AFMT_S32_LE, "AFMT_S32_NE source alias");
_Static_assert(AFMT_S32_OE == AFMT_S32_BE, "AFMT_S32_OE source alias");
_Static_assert(AFMT_U16_NE == AFMT_U16_LE, "AFMT_U16_NE source alias");
_Static_assert(AFMT_U16_OE == AFMT_U16_BE, "AFMT_U16_OE source alias");
_Static_assert(AFMT_U24_NE == AFMT_U24_LE, "AFMT_U24_NE source alias");
_Static_assert(AFMT_U24_OE == AFMT_U24_BE, "AFMT_U24_OE source alias");
_Static_assert(AFMT_U32_NE == AFMT_U32_LE, "AFMT_U32_NE source alias");
_Static_assert(AFMT_U32_OE == AFMT_U32_BE, "AFMT_U32_OE source alias");
_Static_assert(AFMT_F32_NE == AFMT_F32_LE, "AFMT_F32_NE source alias");
_Static_assert(AFMT_F32_OE == AFMT_F32_BE, "AFMT_F32_OE source alias");
_Static_assert(AFMT_FLOAT == AFMT_F32_NE, "AFMT_FLOAT source alias");
_Static_assert(sizeof(audio_buf_info) == 16, "audio_buf_info ABI size");
_Static_assert(_Alignof(audio_buf_info) == 4, "audio_buf_info ABI align");
_Static_assert(offsetof(audio_buf_info, fragments) == 0, "audio_buf_info.fragments ABI offset");
_Static_assert(offsetof(audio_buf_info, fragstotal) == 4, "audio_buf_info.fragstotal ABI offset");
_Static_assert(offsetof(audio_buf_info, fragsize) == 8, "audio_buf_info.fragsize ABI offset");
_Static_assert(offsetof(audio_buf_info, bytes) == 12, "audio_buf_info.bytes ABI offset");
_Static_assert(sizeof(count_info) == 12, "count_info ABI size");
_Static_assert(_Alignof(count_info) == 4, "count_info ABI align");
_Static_assert(offsetof(count_info, bytes) == 0, "count_info.bytes ABI offset");
_Static_assert(offsetof(count_info, blocks) == 4, "count_info.blocks ABI offset");
_Static_assert(offsetof(count_info, ptr) == 8, "count_info.ptr ABI offset");
#endif

#endif /* KANDELO_SYS_SOUNDCARD_H */
